<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [330]:
# adição 

5 + 7

12

In [331]:
# subtração 

21 - 9

12

In [332]:
# multiplicação 

3 * 9

27

In [333]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [334]:
a = 39

In [335]:
b = a + 1

In [336]:
b

40

In [337]:
b * 2

80

**Aquecimento operadores matemáticos**

In [338]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [339]:
resultado = arroz + leite + carne + sabonete + alvejante

In [340]:
resultado

81.44

In [341]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [342]:
# potenciação 

2 ** 2

4

In [343]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [344]:
# igualdade

700 == 90

False

In [345]:
100 == 100

True

In [346]:
80.0 == 80

True

In [347]:
# desigualdade 

3 != 7

True

In [348]:
3 != 3

False

In [349]:
# maior que 

500 > 90

True

In [350]:
90 > 500

False

In [351]:
# menor que 

500 < 90

False

In [352]:
90 < 500

True

In [353]:
# maior ou igual 

8 >= 8

True

In [354]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [355]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [356]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [357]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [358]:
lista = [3, 8, 44, 100]

In [359]:
for x in lista:
    print(x)

3
8
44
100

In [360]:
lista2 = [3, 8, 44, 100]

In [361]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [362]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [363]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [364]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [365]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [366]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [367]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [368]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [369]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [370]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [371]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [372]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [373]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [374]:
print_text()

Aqui é um texto qaulquer

In [375]:
def print_isto(x):
    print(x)

In [376]:
print_isto(7958)

7958

In [377]:
def potencia(x):
    p = x ** 2
    return p

In [378]:
potencia(4)

16

In [379]:
def sub(x):
    r = x + 4
    return r

In [380]:
sub (1000)

1004

In [381]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [382]:
potencia_n(5)

25

In [383]:
potencia_n(5, 3)

125

# MÓDULO 2

### IMPORTS

In [384]:
import pandas as pd
import numpy as np

## 2.1. Dataframes

In [385]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [386]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [387]:
type(series)

pandas.core.series.Series

In [388]:
datas = pd.date_range('20220101', periods = 6 )

In [389]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [390]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [391]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [392]:
df

                   A         B         C         D
2022-01-01  0.368875 -0.467624 -1.138730  0.353323
2022-01-02 -0.554092  0.916343 -0.818891 -1.506623
2022-01-03 -0.725546  0.118226  0.114863 -1.753304
2022-01-04 -0.350230 -0.822414 -0.426441 -0.563034
2022-01-05 -0.185482  0.363767  1.361698 -0.677825
2022-01-06  1.146395 -0.914416 -0.621306 -0.288876

In [393]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [394]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [395]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [396]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [397]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [398]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [399]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [400]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [401]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [402]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [403]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [404]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [405]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [406]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [407]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [408]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [409]:
dfg

            A      B         C         D
0  verdadeiro     um  0.261560 -0.886882
1       falso     um -0.056704  2.190427
2  verdadeiro   dois -1.889658 -1.607883
3       falso   tres  0.922317 -0.529282
4  verdadeiro   dois -0.576508  0.701980
5       falso   dois -0.360011 -0.797675
6  verdadeiro    um   0.446968 -1.422361
7       falso   tres -0.860537 -0.102607

#### Soma dos valores das colunas baseada na coluna A

In [410]:
dfg.groupby(['A']).sum()

                   C         D
A
falso      -0.354935  0.760863
verdadeiro -1.757638 -3.215146

#### Média dos valores das colunas baseada na coluna A

In [411]:
dfg.groupby(['A']).mean()

                   C         D
A
falso      -0.088734  0.190216
verdadeiro -0.439409 -0.803787

#### Soma dos valores das colunas baseada na coluna B

In [412]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -0.360011 -0.797675
dois  -2.466165 -0.905903
tres   0.061780 -0.631890
um     0.204856  1.303546
um     0.446968 -1.422361

#### Média dos valores das colunas baseada na coluna B

In [413]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -0.360011 -0.797675
dois  -1.233083 -0.452952
tres   0.030890 -0.315945
um     0.102428  0.651773
um     0.446968 -1.422361

#### Soma dos valores das colunas baseada nas colunas A e B

In [414]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -0.360011 -0.797675
           tres   0.061780 -0.631890
           um    -0.056704  2.190427
verdadeiro dois  -2.466165 -0.905903
           um     0.261560 -0.886882
           um     0.446968 -1.422361

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [415]:
lista = [ 32, 96, 11, 27]

In [416]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [417]:
lista [-1]

27

### Indexação múltlipla

In [418]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [419]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [420]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [421]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados

In [422]:
datas = pd.date_range('20220101', periods= 6 )

df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [423]:
df

               var_A     var_B     var_C     var_D
2022-01-01  2.663760  1.953038  0.501446 -0.469586
2022-01-02  0.261504  0.398835  0.967028  0.790222
2022-01-03  1.387230 -0.008690 -1.763516  0.329322
2022-01-04 -0.054217  1.292137  0.261489 -1.158126
2022-01-05  1.323795 -1.195064 -1.362531 -1.033582
2022-01-06  0.452582 -0.038903 -0.757357 -1.397330

In [424]:
dft = df.T

In [425]:
dft

       2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
var_A    2.663760    0.261504    1.387230   -0.054217    1.323795    0.452582
var_B    1.953038    0.398835   -0.008690    1.292137   -1.195064   -0.038903
var_C    0.501446    0.967028   -1.763516    0.261489   -1.362531   -0.757357
var_D   -0.469586    0.790222    0.329322   -1.158126   -1.033582   -1.397330

In [426]:
df.shape

(6, 4)

### 2.5.1. Função pivot

In [427]:
data = pd.date_range('20220101', periods= 12 )

pessoa = ['George', 'Victor', 'Lucas']

In [428]:
data

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [429]:
nome = []

gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.randn()*100,2 ))
    
    nome

In [430]:
df = pd.DataFrame({'Data': data, 'Nome': nome, 'Gasto': gasto})

In [431]:
df

         Data    Nome   Gasto
0  2022-01-01  George  105.77
1  2022-01-02  George  -55.02
2  2022-01-03  Victor   63.83
3  2022-01-04  George  -12.84
4  2022-01-05  Victor   -7.37
5  2022-01-06   Lucas   65.01
6  2022-01-07  Victor -129.11
7  2022-01-08  George -152.52
8  2022-01-09  Victor -108.00
9  2022-01-10  George  136.28
10 2022-01-11  Victor -114.83
11 2022-01-12   Lucas  -35.90

In [432]:
pd.pivot(df, index= 'Data', columns= 'Nome', values= 'Gasto')

Nome        George  Lucas  Victor
Data
2022-01-01  105.77    NaN     NaN
2022-01-02  -55.02    NaN     NaN
2022-01-03     NaN    NaN   63.83
2022-01-04  -12.84    NaN     NaN
2022-01-05     NaN    NaN   -7.37
2022-01-06     NaN  65.01     NaN
2022-01-07     NaN    NaN -129.11
2022-01-08 -152.52    NaN     NaN
2022-01-09     NaN    NaN -108.00
2022-01-10  136.28    NaN     NaN
2022-01-11     NaN    NaN -114.83
2022-01-12     NaN -35.90     NaN

### 2.5.2. Função pivot table

In [433]:
carros = [7, 4, 3, 2, 8]

data = pd.date_range('20220101','20220101', periods= 5 )

vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

In [434]:
df = pd.DataFrame({'Vendas': carros, 'Data': data, 'Vendedor': vendedor})

In [435]:
df

   Vendas       Data Vendedor
0       7 2022-01-01   George
1       4 2022-01-01   Vagner
2       3 2022-01-01    Pedro
3       2 2022-01-01   Vagner
4       8 2022-01-01   George

A função **pivot table** não entrega valores de index duplicados

In [436]:
pd.pivot_table(df, index= 'Data', columns= 'Vendedor', values= 'Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2022-01-01      15      3       6

### 2.5.3. Stack e unstack de dados

coleta de dados da internet

In [437]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')

In [438]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [439]:
df.shape

(458, 9)

In [440]:
#Essa função empilha os dados em uma coluna

empilhamento = df.stack()

In [441]:
empilhamento.head(20)

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                 0.0
   Position                PG
   Age                   25.0
   Height                 6-2
   Weight               180.0
   College              Texas
   Salary           7730337.0
1  Name           Jae Crowder
   Team        Boston Celtics
   Number                99.0
   Position                SF
   Age                   25.0
   Height                 6-6
   Weight               235.0
   College          Marquette
   Salary           6796117.0
2  Name          John Holland
   Team        Boston Celtics
dtype: object

In [442]:
# Essa função reverte o processo de empilhamento

empilhamento.unstack()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

### 2.5.4. Função melt

In [443]:
df = pd.DataFrame({ 'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5,},
                    'C': {0: 2, 1: 4, 2: 6}})

In [444]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [445]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [446]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [447]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], var_name='nome da var', value_name='valor da var')

   A nome da var  valor da var
0  a           B             1
1  b           B             3
2  c           B             5
3  a           C             2
4  b           C             4
5  c           C             6

In [448]:
data = {
    'Localização' : ['cidadeA', 'cidadeB'], 
    'Temperatura' : ['prevista', 'atual'],
    'Set-2021':     [30, 32],
    'Out-2021':     [45, 43],
    'Nov-2021':     [24, 22]
}

print(data)

{'Localização': ['cidadeA', 'cidadeB'], 'Temperatura': ['prevista', 'atual'], 'Set-2021': [30, 32], 'Out-2021': [45, 43], 'Nov-2021': [24, 22]}

In [449]:
df = pd.DataFrame(data, columns = ['Localização', 'Temperatura', 'Set-2021', 'Out-2021', 'Nov-2021'])
df

  Localização Temperatura  Set-2021  Out-2021  Nov-2021
0     cidadeA    prevista        30        45        24
1     cidadeB       atual        32        43        22

In [450]:
df2 = pd.melt(df, id_vars=['Localização', 'Temperatura'], var_name='Data', value_name='Valor')

df2

  Localização Temperatura      Data  Valor
0     cidadeA    prevista  Set-2021     30
1     cidadeB       atual  Set-2021     32
2     cidadeA    prevista  Out-2021     45
3     cidadeB       atual  Out-2021     43
4     cidadeA    prevista  Nov-2021     24
5     cidadeB       atual  Nov-2021     22

## 2.6. Seleção de linhas e colunas

In [451]:
datas = pd.date_range('20210101', periods = 600)

df = pd.DataFrame(np.random.rand(600, 5), index = datas, columns = list('ABCDE'))

In [452]:
df.head(4)

                   A         B         C         D         E
2021-01-01  0.021547  0.428380  0.542407  0.279093  0.554962
2021-01-02  0.843119  0.583107  0.531524  0.139144  0.326495
2021-01-03  0.201015  0.724828  0.011241  0.051885  0.367616
2021-01-04  0.367234  0.295923  0.671572  0.281377  0.888606

In [453]:
df['D'].tail(5)

2022-08-19    0.763628
2022-08-20    0.216176
2022-08-21    0.042622
2022-08-22    0.451007
2022-08-23    0.327430
Freq: D, Name: D, dtype: float64

In [454]:
df[1 : 5]

                   A         B         C         D         E
2021-01-02  0.843119  0.583107  0.531524  0.139144  0.326495
2021-01-03  0.201015  0.724828  0.011241  0.051885  0.367616
2021-01-04  0.367234  0.295923  0.671572  0.281377  0.888606
2021-01-05  0.366916  0.354673  0.114978  0.220624  0.813402

In [455]:
df.loc[:, ['B', 'C', 'D']]

                   B         C         D
2021-01-01  0.428380  0.542407  0.279093
2021-01-02  0.583107  0.531524  0.139144
2021-01-03  0.724828  0.011241  0.051885
2021-01-04  0.295923  0.671572  0.281377
2021-01-05  0.354673  0.114978  0.220624
...              ...       ...       ...
2022-08-19  0.497617  0.007763  0.763628
2022-08-20  0.404967  0.502643  0.216176
2022-08-21  0.552447  0.704130  0.042622
2022-08-22  0.447645  0.947670  0.451007
2022-08-23  0.822440  0.984994  0.327430

[600 rows x 3 columns]

**Filtragem do intervalo entre as datas especificadas e das colunas A e C**

In [456]:
df.loc['20220101' : '20220323', ['A', 'C']].head(5)

                   A         C
2022-01-01  0.436381  0.078828
2022-01-02  0.770485  0.143371
2022-01-03  0.069644  0.004678
2022-01-04  0.776966  0.009622
2022-01-05  0.140590  0.978920

**Filtragem de todas as colunas da linha 1**

In [457]:
df.iloc[1]

A    0.843119
B    0.583107
C    0.531524
D    0.139144
E    0.326495
Name: 2021-01-02 00:00:00, dtype: float64

**Filtragem de um intervalo específico entre linhas e colunas (1º intervalo linhas, 2º colunas)**

In [458]:
df.iloc[1:4, 1: 6]

                   B         C         D         E
2021-01-02  0.583107  0.531524  0.139144  0.326495
2021-01-03  0.724828  0.011241  0.051885  0.367616
2021-01-04  0.295923  0.671572  0.281377  0.888606

**Filtragem de linhas e colunas escolhidas**

In [459]:
df.iloc[[7, 4, 8], [0, 3]]

                   A         D
2021-01-08  0.537620  0.166507
2021-01-05  0.366916  0.220624
2021-01-09  0.941162  0.855022

**Filtros booleanos**

In [460]:
df[df.A>0]

                   A         B         C         D         E
2021-01-01  0.021547  0.428380  0.542407  0.279093  0.554962
2021-01-02  0.843119  0.583107  0.531524  0.139144  0.326495
2021-01-03  0.201015  0.724828  0.011241  0.051885  0.367616
2021-01-04  0.367234  0.295923  0.671572  0.281377  0.888606
2021-01-05  0.366916  0.354673  0.114978  0.220624  0.813402
...              ...       ...       ...       ...       ...
2022-08-19  0.507953  0.497617  0.007763  0.763628  0.535182
2022-08-20  0.038485  0.404967  0.502643  0.216176  0.035315
2022-08-21  0.267950  0.552447  0.704130  0.042622  0.906845
2022-08-22  0.688848  0.447645  0.947670  0.451007  0.009681
2022-08-23  0.581289  0.822440  0.984994  0.327430  0.282426

[600 rows x 5 columns]

In [461]:
df[df > 0]

                   A         B         C         D         E
2021-01-01  0.021547  0.428380  0.542407  0.279093  0.554962
2021-01-02  0.843119  0.583107  0.531524  0.139144  0.326495
2021-01-03  0.201015  0.724828  0.011241  0.051885  0.367616
2021-01-04  0.367234  0.295923  0.671572  0.281377  0.888606
2021-01-05  0.366916  0.354673  0.114978  0.220624  0.813402
...              ...       ...       ...       ...       ...
2022-08-19  0.507953  0.497617  0.007763  0.763628  0.535182
2022-08-20  0.038485  0.404967  0.502643  0.216176  0.035315
2022-08-21  0.267950  0.552447  0.704130  0.042622  0.906845
2022-08-22  0.688848  0.447645  0.947670  0.451007  0.009681
2022-08-23  0.581289  0.822440  0.984994  0.327430  0.282426

[600 rows x 5 columns]

## 2.7. Limpeza dos dados

### 2.7.1 Sumarização dos dados

In [462]:
datas = pd.date_range('20180101', periods = 6)

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [463]:
df2 = pd.DataFrame({'A': pd.Timestamp('20130102'),
                    'B': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'C': np.array([3] * 4, dtype = 'int32'),
                    'D': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'
    
})

In [464]:
df

               var_A     var_B     var_C     var_D
2018-01-01  0.246660 -0.263178  1.552661 -0.109595
2018-01-02 -0.851810  0.536350 -1.353763 -2.540346
2018-01-03 -1.195132 -2.201084 -0.483701 -0.453930
2018-01-04 -2.833019 -0.882256 -0.337155  1.427728
2018-01-05  0.311277 -0.201444 -1.184356 -0.648900
2018-01-06  0.092450 -0.282128 -0.430210  0.121224

In [465]:
df.shape

(6, 4)

In [466]:
df.dtypes

var_A    float64
var_B    float64
var_C    float64
var_D    float64
dtype: object

In [467]:
df.describe()

          var_A     var_B     var_C     var_D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.704929 -0.548957 -0.372754 -0.367303
std    1.213643  0.926514  1.033942  1.291211
min   -2.833019 -2.201084 -1.353763 -2.540346
25%   -1.109302 -0.732224 -1.009192 -0.600158
50%   -0.379680 -0.272653 -0.456956 -0.281763
75%    0.208107 -0.216878 -0.360419  0.063520
max    0.311277  0.536350  1.552661  1.427728

In [468]:
df2

           A    B  C      D       F
0 2013-01-02  1.0  3   test  Python
1 2013-01-02  1.0  3  train  Python
2 2013-01-02  1.0  3   test  Python
3 2013-01-02  1.0  3  train  Python

In [469]:
df.shape

(6, 4)

In [470]:
df2.dtypes

A    datetime64[ns]
B           float32
C             int32
D          category
F            object
dtype: object

In [471]:
df2.describe()

         B    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [472]:
df

               var_A     var_B     var_C     var_D
2018-01-01  0.246660 -0.263178  1.552661 -0.109595
2018-01-02 -0.851810  0.536350 -1.353763 -2.540346
2018-01-03 -1.195132 -2.201084 -0.483701 -0.453930
2018-01-04 -2.833019 -0.882256 -0.337155  1.427728
2018-01-05  0.311277 -0.201444 -1.184356 -0.648900
2018-01-06  0.092450 -0.282128 -0.430210  0.121224

In [473]:
df1 = df.reindex(index = datas [ 0: 4 ], columns = list(df.columns) + ['var_E'])

In [474]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01  0.246660 -0.263178  1.552661 -0.109595    NaN
2018-01-02 -0.851810  0.536350 -1.353763 -2.540346    NaN
2018-01-03 -1.195132 -2.201084 -0.483701 -0.453930    NaN
2018-01-04 -2.833019 -0.882256 -0.337155  1.427728    NaN

In [475]:
df1.loc[datas[0]: datas [1], 'var_E'] = 77

In [476]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01  0.246660 -0.263178  1.552661 -0.109595   77.0
2018-01-02 -0.851810  0.536350 -1.353763 -2.540346   77.0
2018-01-03 -1.195132 -2.201084 -0.483701 -0.453930    NaN
2018-01-04 -2.833019 -0.882256 -0.337155  1.427728    NaN

In [477]:
df1.describe()

          var_A     var_B     var_C     var_D  var_E
count  4.000000  4.000000  4.000000  4.000000    2.0
mean  -1.158325 -0.702542 -0.155490 -0.419036   77.0
std    1.274609  1.155540  1.223977  1.633755    0.0
min   -2.833019 -2.201084 -1.353763 -2.540346   77.0
25%   -1.604604 -1.211963 -0.701217 -0.975534   77.0
50%   -1.023471 -0.572717 -0.410428 -0.281763   77.0
75%   -0.577193 -0.063296  0.135299  0.274735   77.0
max    0.246660  0.536350  1.552661  1.427728   77.0

### 2.7.2. Dados faltantes NaN

In [478]:
datas = pd.date_range('20180101', periods = 60, freq="D")

df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE"))

In [479]:
df.head(3)

                   A         B         C         D         E
2018-01-01 -0.033405  0.065932  0.678457 -1.215829 -0.605459
2018-01-02 -0.122190  0.160209 -0.121218 -1.126751  0.753587
2018-01-03  0.301857 -0.464063  1.836580  0.165792 -0.387519

In [480]:
df['F'] = df.A[df.A > 0]

In [481]:
df.head(3)

                   A         B         C         D         E         F
2018-01-01 -0.033405  0.065932  0.678457 -1.215829 -0.605459       NaN
2018-01-02 -0.122190  0.160209 -0.121218 -1.126751  0.753587       NaN
2018-01-03  0.301857 -0.464063  1.836580  0.165792 -0.387519  0.301857

In [482]:
df1 = df.copy()

In [483]:
df2 = df.copy()

**Extração dos valores NaN. Sempre que ultilizamos este comando, também perdemos os demais dados da linha.**

In [484]:
df1.dropna().shape

(31, 6)

In [485]:
df.shape

(60, 6)

In [486]:
df2.head()

                   A         B         C         D         E         F
2018-01-01 -0.033405  0.065932  0.678457 -1.215829 -0.605459       NaN
2018-01-02 -0.122190  0.160209 -0.121218 -1.126751  0.753587       NaN
2018-01-03  0.301857 -0.464063  1.836580  0.165792 -0.387519  0.301857
2018-01-04 -0.007032 -0.038534 -0.038928 -1.153859  2.162086       NaN
2018-01-05  1.590059  0.412589  0.264971 -0.661633 -0.004108  1.590059

**Substituição dos valores NaN pela média da coluna F**

In [487]:
df2.F.fillna(np.mean(df2.F))

2018-01-01    0.632934
2018-01-02    0.632934
2018-01-03    0.301857
2018-01-04    0.632934
2018-01-05    1.590059
2018-01-06    0.353272
2018-01-07    0.204678
2018-01-08    0.448992
2018-01-09    0.338114
2018-01-10    2.056521
2018-01-11    0.632934
2018-01-12    0.793912
2018-01-13    0.632934
2018-01-14    0.632934
2018-01-15    0.632934
2018-01-16    0.817093
2018-01-17    0.632934
2018-01-18    0.242279
2018-01-19    0.632934
2018-01-20    0.632934
2018-01-21    0.387488
2018-01-22    0.607969
2018-01-23    0.760622
2018-01-24    0.632934
2018-01-25    0.256496
2018-01-26    0.202236
2018-01-27    0.632934
2018-01-28    0.632934
2018-01-29    0.527507
2018-01-30    0.255153
2018-01-31    1.474785
2018-02-01    0.632934
2018-02-02    0.632934
2018-02-03    0.632934
2018-02-04    0.488812
2018-02-05    0.632934
2018-02-06    0.632934
2018-02-07    0.632934
2018-02-08    1.498705
2018-02-09    2.280314
2018-02-10    0.249256
2018-02-11    0.732251
2018-02-12    0.632934
2018-02-13    0.632934
2018-02-14    0.386506
2018-02-15    0.632934
2018-02-16    0.632934
2018-02-17    0.632934
2018-02-18    0.117567
2018-02-19    0.632934
2018-02-20    0.306789
2018-02-21    0.632934
2018-02-22    0.078274
2018-02-23    0.222355
2018-02-24    0.368703
2018-02-25    0.632934
2018-02-26    0.632934
2018-02-27    0.501694
2018-02-28    0.770685
2018-03-01    0.632934
Freq: D, Name: F, dtype: float64

In [488]:
df3 = df.copy()

**Substituição de TODOS os valores NaN da tabela por 777**

In [489]:
df3.fillna(value = 777)

                   A         B         C         D         E           F
2018-01-01 -0.033405  0.065932  0.678457 -1.215829 -0.605459  777.000000
2018-01-02 -0.122190  0.160209 -0.121218 -1.126751  0.753587  777.000000
2018-01-03  0.301857 -0.464063  1.836580  0.165792 -0.387519    0.301857
2018-01-04 -0.007032 -0.038534 -0.038928 -1.153859  2.162086  777.000000
2018-01-05  1.590059  0.412589  0.264971 -0.661633 -0.004108    1.590059
2018-01-06  0.353272 -0.255948 -0.304905  0.165491  1.511347    0.353272
2018-01-07  0.204678  0.211893 -1.033119  0.430512  0.283768    0.204678
2018-01-08  0.448992 -1.130225  0.333658  1.903283  0.196417    0.448992
2018-01-09  0.338114  1.416623  1.295214 -0.578358  0.357398    0.338114
2018-01-10  2.056521 -0.604803  0.235799  0.016352  1.541257    2.056521
2018-01-11 -0.625231  0.911742 -0.259857  1.127223 -0.909315  777.000000
2018-01-12  0.793912  0.585674  0.310868 -1.445733 -1.213014    0.793912
2018-01-13 -0.200659  0.259516 -1.302899 -1.375056  0.701609  777.000000
2018-01-14 -0.374041 -0.739086 -0.614743 -0.264745 -0.762149  777.000000
2018-01-15 -1.010645  0.141492  1.303574 -1.153040 -0.668357  777.000000
2018-01-16  0.817093 -0.868982 -0.244973 -2.096274  0.119588    0.817093
2018-01-17 -0.591892  0.176132  0.326398  0.471566 -0.223348  777.000000
2018-01-18  0.242279 -0.482786 -1.206748 -0.794091  2.344652    0.242279
2018-01-19 -0.471243  0.070704 -0.227539 -0.289980  1.630482  777.000000
2018-01-20 -0.093837  1.339178 -0.763018 -0.324734  0.540417  777.000000
2018-01-21  0.387488 -0.691933  0.541393 -0.073885  1.648393    0.387488
2018-01-22  0.607969 -0.358856 -0.244973  0.210821  0.190132    0.607969
2018-01-23  0.760622 -0.376243  1.868073  0.052494  0.662541    0.760622
2018-01-24 -1.373584 -2.287985 -1.708430  0.488802 -0.531597  777.000000
2018-01-25  0.256496  0.309716  1.329276 -0.570413 -0.806534    0.256496
2018-01-26  0.202236  0.166475  1.181956  0.719204 -2.869129    0.202236
2018-01-27 -0.169629 -0.390872 -0.249137 -0.966835  0.805089  777.000000
2018-01-28 -1.202606 -0.393204 -0.621431  1.331697 -0.585501  777.000000
2018-01-29  0.527507  0.239640  1.217683  0.171927 -0.697738    0.527507
2018-01-30  0.255153 -0.389501 -0.001845 -1.042469 -0.612030    0.255153
2018-01-31  1.474785 -1.499036 -0.796443  0.338740 -0.399724    1.474785
2018-02-01 -0.747439  0.588217 -0.614902  0.346972  0.296083  777.000000
2018-02-02 -1.387098 -0.342154  0.849810 -0.239163 -1.528750  777.000000
2018-02-03 -0.449346 -0.380232  0.245011 -0.261457  0.150098  777.000000
2018-02-04  0.488812 -0.878475 -1.430957 -0.883332  0.250535    0.488812
2018-02-05 -0.797891 -0.005918  1.932399 -1.144887  0.027056  777.000000
2018-02-06 -0.716385 -1.684141  0.013656  0.449430 -0.937184  777.000000
2018-02-07 -0.920314  0.363915  0.438543  0.106845 -0.621797  777.000000
2018-02-08  1.498705  1.768490  0.696912  0.496568 -0.794234    1.498705
2018-02-09  2.280314  0.839355  0.021807 -2.455570 -0.132898    2.280314
2018-02-10  0.249256  0.346101  0.843451  0.008687  1.870715    0.249256
2018-02-11  0.732251 -1.559913 -0.699191 -0.260448  1.075539    0.732251
2018-02-12 -0.081742  1.867763  0.014033 -0.491216  0.743154  777.000000
2018-02-13 -0.038027 -2.429784 -1.285886  0.510311 -1.160909  777.000000
2018-02-14  0.386506 -0.447899 -0.388033 -0.222615 -0.131726    0.386506
2018-02-15 -0.651520  1.663082 -0.635163  1.464676 -0.857727  777.000000
2018-02-16 -0.310666 -0.760781  1.303372  0.767291  1.392962  777.000000
2018-02-17 -1.642733  1.406131  0.335110  1.329161 -1.152537  777.000000
2018-02-18  0.117567  0.009085  0.311748 -0.487979  0.509658    0.117567
2018-02-19 -2.739616  0.546448  0.780110  0.569931  1.563356  777.000000
2018-02-20  0.306789  0.046518 -2.464424  0.871162  0.783685    0.306789
2018-02-21 -2.668223  0.338729 -0.490114  1.303063 -0.071273  777.000000
2018-02-22  0.078274 -0.574376  1.251181 -0.524113 -0.067606    0.078274
2018-02-23  0.222355  0.239966  0.608473  1.453050 -0.003458    0.222355
2018-02-24  0.368703 -0.873924  0.603701 -1.620020  0.981318    0.368703
2018-02-25 -0.259766  2.554854 -1.495099 -0.290476 -0.741385  777.000000
2018-02-26 -0.132262 -0.288803 -0.375208  0.906621 -0.068754  777.000000
2018-02-27  0.501694 -0.556252 -0.327277 -1.217243  1.866320    0.501694
2018-02-28  0.770685 -0.666044 -0.970635 -1.545690  1.258156    0.770685
2018-03-01 -0.682233 -0.223522 -0.754884 -0.518306  0.594068  777.000000

### 2.7.3. Dados únicos

In [490]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python',
                    'G': [2, 2, 4, 4],
                    'H': [np.nan, 2, 4, np.nan]
    
})

In [491]:
df2

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

Sempre que usar a função nunique ela aponta os dados ÚNICOS ( axis=0 está relacionado a linha e axis= 1 à coluna)

In [492]:
df2.nunique(axis = 1, dropna = True)

0    6
1    6
2    6
3    6
dtype: int64

### 2.7.4. Dados duplicados

**Essa função mostra valores duplicados em todas as linhas**

In [493]:
df2.drop_duplicates()

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

**Essa função mantém o 1° valor e exclui os valores duplicados na coluna especificada**

In [494]:
df2.drop_duplicates(subset= 'G')

     A          B    C  D     E       F  G    H
0  1.0 2013-01-02  1.0  3  test  Python  2  NaN
2  1.0 2013-01-02  1.0  3  test  Python  4  4.0

### 2.7.5. Ordenação dos dados

In [495]:
df = pd.DataFrame({
                    'col1' : [ 'A', 'A', 'B', np.nan, 'D', 'C' ],  
                    'col2' : [ 2, 1, 9, 8, 7, 4 ],
                    'col3' : [ 0, 1, 9, 4, 2, 3 ],
                })

In [496]:
df

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
3  NaN     8     4
4    D     7     2
5    C     4     3

**Ordenação de valores pela coluna 1**

In [497]:
df.sort_values(by='col1')

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

**Ordenação de valores pelas colunas 1 e 2**

In [498]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3
1    A     1     1
0    A     2     0
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

**Ordenação de valores pelas colunas 1 e 2 de forma decrescente**

In [499]:
df.sort_values(by=['col1', 'col2'], ascending= False)

  col1  col2  col3
4    D     7     2
5    C     4     3
2    B     9     9
0    A     2     0
1    A     1     1
3  NaN     8     4

In [500]:
df.sort_values('col1', ascending= True)

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4